In [3]:
#1
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Evan'],
        'Age': [22, 23, 24, 22, 25],
        'Major': ['Biology', 'Computer Science', 'Mathematics', 'Physics', 'Chemistry']}

import pandas as pd
students_df = pd.DataFrame(data)
print(students_df)

      Name  Age             Major
0    Alice   22           Biology
1      Bob   23  Computer Science
2  Charlie   24       Mathematics
3    Diana   22           Physics
4     Evan   25         Chemistry

In [4]:
#2
students_df.head(3)

      Name  Age             Major
0    Alice   22           Biology
1      Bob   23  Computer Science
2  Charlie   24       Mathematics

In [5]:
#3
students_df[["Age", "Major"]]

   Age             Major
0   22           Biology
1   23  Computer Science
2   24       Mathematics
3   22           Physics
4   25         Chemistry

In [17]:
#4
students_df["GradYear"] = [2022, 2023, 2023, None, 2024]
print(students_df)

      Name             Major  GradYear
0    Alice           Biology    2022.0
1      Bob  Computer Science    2023.0
2  Charlie       Mathematics    2023.0
3    Diana           Physics       NaN
4     Evan         Chemistry    2024.0

In [18]:
#5
filtered_df = students_df[(students_df['Major']=='Computer Science')|(students_df['Major'] == 'Physics')]

print(filtered_df)

    Name             Major  GradYear
1    Bob  Computer Science    2023.0
3  Diana           Physics       NaN

In [19]:
#6
print(students_df.iloc[[1,3]])

    Name             Major  GradYear
1    Bob  Computer Science    2023.0
3  Diana           Physics       NaN

In [ ]:
#7
students_df.drop('Age', axis=1, inplace=True)
print(students_df)

In [31]:
#8
students_df.fillna({"GradYear" : 2023}, inplace=True)
students_df["GradYear"] = students_df["GradYear"].astype(int)
print(students_df)

      Name             Major  GradYear
0    Alice           Biology      2022
1      Bob  Computer Science      2023
2  Charlie       Mathematics      2023
3    Diana           Physics      2023
4     Evan         Chemistry      2024

In [32]:
#9
students_df.groupby("Major")["GradYear"].mean()

Major
Biology             2022.0
Chemistry           2024.0
Computer Science    2023.0
Mathematics         2023.0
Physics             2023.0
Name: GradYear, dtype: float64

In [36]:
#10
sorted_df = students_df.sort_values(by="GradYear", ascending=False)
sorted_df.head(3)

      Name             Major  GradYear
4     Evan         Chemistry      2024
1      Bob  Computer Science      2023
2  Charlie       Mathematics      2023

In [40]:
#11
advanced_filter_df = students_df[(students_df["Major"]=="Chemistry") | (students_df["GradYear"]<2023)]
advanced_filter_df

    Name      Major  GradYear
0  Alice    Biology      2022
4   Evan  Chemistry      2024

In [45]:
#12
for index, row in students_df.iterrows():
    if row["GradYear"]==2023:
        print(f"Name :{row['Name']}, Major: {row['Major']}")

Name :Bob, Major: Computer Science
Name :Charlie, Major: Mathematics
Name :Diana, Major: Physics